CurrencyConvertor_RpcServer_Java-RabbitMQ/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header><gs:UserName>CarReffffntalAPI</gs:UserName><gs:Password>p455w0rd</gs:Password></soapenv:Header>
   <soapenv:Body>
      <gs:getExchangeRateRequest>
         <gs:fromCCY>USD</gs:fromCCY>
         <gs:toCCY>EUR</gs:toCCY>
      </gs:getExchangeRateRequest>
   </soapenv:Body>
</soapenv:Envelope>
